|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [145]:
import pandas as pd
import numpy as np

In [146]:
df=pd.read_csv('../titanic_dataset.csv')        #back 2 folder
print(df.head)

<bound method NDFrame.head of       Unnamed: 0  pclass  survived  \
0              0       1         1
1              1       1         1
2              2       1         0
3              3       1         0
4              4       1         0
...          ...     ...       ...
1304        1304       3         0
1305        1305       3         0
1306        1306       3         0
1307        1307       3         0
1308        1308       3         0

                                                 name  gender      age  sibsp  \
0                       Allen, Miss. Elisabeth Walton  female  29.0000      0
1                      Allison, Master. Hudson Trevor    male   0.9167      1
2                        Allison, Miss. Helen Loraine  female   2.0000      1
3                Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1
...                                               ...     ...      ...    ...
1304                             Zabour, Miss. Hileni  female  14.5000      1
1305                            Zabour, Miss. Thamine  female      NaN      1
1306                        Zakarian, Mr. Mapriededer    male  26.5000      0
1307                              Zakarian, Mr. Ortin    male  27.0000      0
1308                               Zimmerman, Mr. Leo    male  29.0000      0

      parch  ticket      fare    cabin embarked boat   body  \
0         0   24160  $211.34        B5        S    2    NaN
1         2  113781  $151.55   C22 C26        S   11    NaN
2         2  113781  $151.55   C22 C26        S  NaN    NaN
3         2  113781  $151.55   C22 C26        S  NaN  135.0
4         2  113781  $151.55   C22 C26        S  NaN    NaN
...     ...     ...       ...      ...      ...  ...    ...
1304      0    2665   $14.45       NaN        C  NaN  328.0
1305      0    2665   $14.45       NaN        C  NaN    NaN
1306      0    2656    $7.23       NaN        C  NaN  304.0
1307      0    2670    $7.23       NaN        C  NaN    NaN
1308      0  315082    $7.88       NaN        S  NaN    NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1309 rows x 15 columns]>

In [147]:
print(df.describe(include='all'))

         Unnamed: 0       pclass     survived              name gender  \
count   1309.000000  1309.000000  1309.000000              1309   1309
unique          NaN          NaN          NaN              1307      2
top             NaN          NaN          NaN  Kelly, Mr. James   male
freq            NaN          NaN          NaN                 2    843
mean     654.000000     2.294882     0.381971               NaN    NaN
std      378.020061     0.837836     0.486055               NaN    NaN
min        0.000000     1.000000     0.000000               NaN    NaN
25%      327.000000     2.000000     0.000000               NaN    NaN
50%      654.000000     3.000000     0.000000               NaN    NaN
75%      981.000000     3.000000     1.000000               NaN    NaN
max     1308.000000     3.000000     1.000000               NaN    NaN

                age        sibsp        parch    ticket    fare        cabin  \
count   1046.000000  1309.000000  1309.000000      1309    1308          295
unique          NaN          NaN          NaN       929     263          186
top             NaN          NaN          NaN  CA. 2343  $8.05   C23 C25 C27
freq            NaN          NaN          NaN        11      60            6
mean      29.881135     0.498854     0.385027       NaN     NaN          NaN
std       14.413500     1.041658     0.865560       NaN     NaN          NaN
min        0.166700     0.000000     0.000000       NaN     NaN          NaN
25%       21.000000     0.000000     0.000000       NaN     NaN          NaN
50%       28.000000     0.000000     0.000000       NaN     NaN          NaN
75%       39.000000     1.000000     0.000000       NaN     NaN          NaN
max       80.000000     8.000000     9.000000       NaN     NaN          NaN

       embarked boat        body     home.dest
count      1307  486  121.000000           745
unique        3   27         NaN           369
top           S   13         NaN  New York, NY
freq        914   39         NaN            64
mean        NaN  NaN  160.809917           NaN
std         NaN  NaN   97.696922           NaN
min         NaN  NaN    1.000000           NaN
25%         NaN  NaN   72.000000           NaN
50%         NaN  NaN  155.000000           NaN
75%         NaN  NaN  256.000000           NaN
max         NaN  NaN  328.000000           NaN

In [148]:
#names of cold where atleast one value is missing

print(df.columns[df.isnull().any()])

r=df.count()
print(r[r<=r.shape[0]])

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')
Series([], dtype: int64)

In [149]:
print(df.shape)

(1309, 15)

In [150]:
th=len(df)*.75
r=df.dropna(thresh=th,axis=1)
print(df.columns)
print(r.columns)

print(df.count()/1305*100)

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body',
       'home.dest'],
      dtype='object')
Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')
Unnamed: 0    100.306513
pclass        100.306513
survived      100.306513
name          100.306513
gender        100.306513
age            80.153257
sibsp         100.306513
parch         100.306513
ticket        100.306513
fare          100.229885
cabin          22.605364
embarked      100.153257
boat           37.241379
body            9.272031
home.dest      57.088123
dtype: float64

In [151]:
#drop columns having independent values(which do not affect the survival rate).
df.drop(columns=['boat','Unnamed: 0'],axis=1,inplace=True)
print(df.head)

<bound method NDFrame.head of       pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

      gender      age  sibsp  parch  ticket      fare    cabin embarked  \
0     female  29.0000      0      0   24160  $211.34        B5        S
1       male   0.9167      1      2  113781  $151.55   C22 C26        S
2     female   2.0000      1      2  113781  $151.55   C22 C26        S
3       male  30.0000      1      2  113781  $151.55   C22 C26        S
4     female  25.0000      1      2  113781  $151.55   C22 C26        S
...      ...      ...    ...    ...     ...       ...      ...      ...
1304  female  14.5000      1      0    2665   $14.45       NaN        C
1305  female      NaN      1      0    2665   $14.45       NaN        C
1306    male  26.5000      0      0    2656    $7.23       NaN        C
1307    male  27.0000      0      0    2670    $7.23       NaN        C
1308    male  29.0000      0      0  315082    $7.88       NaN        S

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 13 columns]>

In [152]:
# check data types of all columns




print(df.dtypes)

pclass         int64
survived       int64
name          object
gender        object
age          float64
sibsp          int64
parch          int64
ticket        object
fare          object
cabin         object
embarked      object
body         float64
home.dest     object
dtype: object

In [153]:
# convert price to numeric
print(df['fare'].head())
print(df.fare.dtypes)

df['fare'] = pd.to_numeric(df['fare'].astype(str).str[1:], errors='coerce')

print(df.fare.head())

0    $211.34
1    $151.55
2    $151.55
3    $151.55
4    $151.55
Name: fare, dtype: object
object
0    211.34
1    151.55
2    151.55
3    151.55
4    151.55
Name: fare, dtype: float64

In [154]:
# find columns still having missing/na values and also count of missing data
print(df.isna().any())
print(df.isna().sum())

pclass       False
survived     False
name         False
gender       False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
body          True
home.dest     True
dtype: bool
pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
body         1188
home.dest     564
dtype: int64

In [155]:
# fill na with mean for fare and age column column.
print(df.fare.isna().any())
df['fare'].fillna(df['fare'].mean(),inplace=True)
print(df.fare.isna().any())

print(df.age.isna().any())
df['age'].fillna(df['age'].mean(),inplace=True)
print(df.age.isna().any())

True
False
True
False

In [156]:
# drop na values for embarked column.
print(df.embarked.isna().any())
df['embarked'].dropna(inplace=True)
print(df.embarked.isna().any())

True
False

In [157]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered.csv')

In [158]:
# for surviced column replace 0 with D and 1 with A

print(df.survived[df['survived'].isin([0,1])].head())

df.survived.replace({0:'D',1:'A'},inplace=True)
print(df['survived'].head())

0    1
1    1
2    0
3    0
4    0
Name: survived, dtype: int64
0    A
1    A
2    D
3    D
4    D
Name: survived, dtype: object

In [167]:
# find the frequency of different values in survived column

grp=df.groupby(by='survived')
print(grp.survived.count())

print(df['survived'].value_counts())

survived
A    500
D    809
Name: survived, dtype: int64
D    809
A    500
Name: survived, dtype: int64

In [173]:
# group by gender and survived and see the counts in each category

grp=df.groupby(by=['gender','survived'])
print(grp[['gender','survived']].count())

                 gender  survived
gender survived
female A            339       339
       D            127       127
male   A            161       161
       D            682       682

In [189]:
# find different pclass and no of people in each class
print(df.pclass.unique())
print(df.pclass.value_counts())

[1 2 3]
3    709
1    323
2    277
Name: pclass, dtype: int64

In [202]:
# find top 5 people with highest values of age. Count no of male and females in the top 5

df1=df.sort_values('age',ascending=False).head()
print(df1[['name','age','gender']])

grp=df1.groupby('gender')
print(grp.gender.count())

                                                   name   age  gender
14                 Barkworth, Mr. Algernon Henry Wilson  80.0    male
61    Cavendish, Mrs. Tyrell William (Julia Florence...  76.0  female
1235                                Svensson, Mr. Johan  74.0    male
135                           Goldschmidt, Mr. George B  71.0    male
9                               Artagaveytia, Mr. Ramon  71.0    male
gender
female    1
male      4
Name: gender, dtype: int64

In [247]:
# find max age male and female who survived


df1=df[df.survived=='A']
grp=df1.groupby(['gender'])
print(grp.age.agg(max))

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [250]:
# get average age by gender
grp=df.groupby('gender').age.agg(np.mean)
print(grp)

gender
female    28.886935
male      30.430716
Name: age, dtype: float64

In [251]:
# get average age by people survived vs not-survived

grp=df.groupby('survived').age.agg(np.mean)
print(grp)

survived
A    29.058812
D    30.389368
Name: age, dtype: float64